Documents/ЗаписьНаЗанятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ЗаписьНаЗанятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Занятие</Name>
      <ValueType><v8:Type>cfg:DocumentRef.Занятие</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.Занятие</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаЗаписи</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ИсточникЗаписи</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗаписи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗаписи</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыПосещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыПосещения</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Присутствовал</Name>
    </Value>
    <Value>
      <Name>Отсутствовал</Name>
    </Value>
    <Value>
      <Name>ОтменилЗаранее</Name>
    </Value>
    <Value>
      <Name>ОтменилПоздно</Name>
    </Value>
    <Value>
      <Name>УважительнаяПричина</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/ЗаписьНаЗанятие/Ext/ObjectModule.bsl
// Модуль документа Запись на занятие

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Автоматическая проверка наличия действующего абонемента
	Если ПустоеЗначение(Абонемент) Тогда
		Абонемент = РаботаСОстаткамиАбонементов.АктивныйАбонементКлиента(Клиент);
	КонецЕсли;

	Если ПустоеЗначение(Абонемент) Тогда
		ВызватьИсключение "Невозможно создать запись: у клиента отсутствует действующий абонемент.";
	КонецЕсли;

	Если РаботаСОстаткамиАбонементов.ОстатокЗанятийПоАбонементу(Абонемент) <= 0 Тогда
		ВызватьИсключение "Невозможно создать запись: абонемент клиента закончился.";
	КонецЕсли;

	// Добавляем клиента в участники занятия
	ЗанятиеОбъект = Занятие.ПолучитьОбъект();
	УжеЗаписан = Ложь;
	Для Каждого СтрокаУчастников ИЗ ЗанятиеОбъект.Участники Цикл
		Если СтрокаУчастников.Клиент = Клиент Тогда
			УжеЗаписан = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не УжеЗаписан Тогда
		НоваяСтрока = ЗанятиеОбъект.Участники.Добавить();
		НоваяСтрока.Клиент = Клиент;
		НоваяСтрока.Абонемент = Абонемент;
		НоваяСтрока.СтатусПосещения = Перечисления.СтатусыПосещения.Отсутствовал;
		ЗанятиеОбъект.Записать();
	КонецЕсли;

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Запись клиента", "", Строка(Клиент));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Клиент) Тогда
		Сообщить("Не заполнен клиент");
		Отказ = Истина;
	КонецЕсли;
	Если ПустоеЗначение(Занятие) Тогда
		Сообщить("Не выбрано занятие");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
